
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/shimota-dev/aws-ecs-terraform/actions/runs/4776211677)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008e5722bf30b8142]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b187818db468838e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-068e23561f8f078c6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0846e4a017b57f8f5]
aws_security_group.alb: Refreshing state... [id=sg-018d694f340c980d4]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0feb4c9a6e80d8e33]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-043da24431e45029f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:targetgroup/go-simple-server-target-group/9fdb956edca04d04]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b50b2476369bbd39]
aws_security_group.ecs: Refreshing state... [id=sg-0be0c682e474673e2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0057ecae1b13d1a40]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-098d91b31f5e3673c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c2c430090da69c66]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033643a06f76e4b0c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07de421700351d7bf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-098322cf3202fb0ac]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca4f15a04c6d08c9]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2223750602]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05c2ce13ee4a00ce3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024def2a266365ea4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07de421700351d7bf1080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-012e09e94b920d8cd]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:loadbalancer/app/go-simple-server-alb/6d2089c9be21f289]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065f54d280fda9f9d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0645b77e410c9fc4c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c96c0c5544b9b515]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-098d91b31f5e3673c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033643a06f76e4b0c1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener-rule/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed/14f32ccd720edba0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"0c1f385a78cbbf6cc2749136356e60132886dfa4","Vars":{},"WorkflowName":"Terraform"} -->